using System;
namespace ht_698._45
{
    public enum DAR
    {
        成功 = 0,
        硬件失效 = 1,
        暂时失效 = 2,
        拒绝读写 = 3,
        对象未定义 = 4,
        对象接口类不符合 = 5,
        对象不存在 = 6,
        类型不匹配 = 7,
        越界 = 8,
        数据块不可用 = 9,
        分帧传输已取消 = 10,
        不处于分帧传输状态 = 11,
        块写取消 = 12,
        不存在块写状态 = 13,
        数据块序号无效 = 14,
        密码错未授权 = 15,
        通信速率不能更改 = 0x10,
        年时区数超 = 0x11,
        日时段数超 = 0x12,
        费率数超 = 0x13,
        安全认证不匹配 = 20,
        重复充值 = 0x15,
        ESAM验证失败 = 0x16,
        安全认证失败 = 0x17,
        客户编号不匹配 = 0x18,
        充值次数错误 = 0x19,
        购电超囤积 = 0x1a,
        地址异常 = 0x1b,
        对称解密错误 = 0x1c,
        非对称解密错误 = 0x1d,
        签名错误 = 30,
        电能表挂起 = 0x1f,
        时间标签无效 = 0x20,
        请求超时 = 0x21,
        ESAM的P1P2不正确 = 0x22,
        ESAM的LC错误 = 0x23,
        其它 = 0xff
    }
}

